batch.log

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <getProductDetails xmlns="http://magazzino.example.com/ws">      <productId>827635</productId>    </getProductDetails>  </soap:Body></soap:Envelope>